In [1]:
import pandas as pd

In [2]:
dataframe = pd.read_csv('demodataset.csv')

In [3]:
dataframe

    Name Location   Age  Score BloodGroup  Eligible
0   Jhon       CA   NaN    9.0       B+ve       0.0
1   Mike       LA  32.0    9.0       B+ve       1.0
2   Dane       NY   NaN    8.0       A-ve       NaN
3  Peter       NY  33.0    2.0       O+ve       0.0
4  Macey      NaN   NaN    NaN       O-ve       0.0
5  Chimp       CA  53.0    4.0       A-ve       0.0
6  Jacob    TEXAS  34.0    5.0       A+ve       1.0
7   Dany       DC  21.0    1.0      AB-ve       1.0

In [4]:
dataframe.head(3) #it will display first 3 rows details.

   Name Location   Age  Score BloodGroup  Eligible
0  Jhon       CA   NaN    9.0       B+ve       0.0
1  Mike       LA  32.0    9.0       B+ve       1.0
2  Dane       NY   NaN    8.0       A-ve       NaN

In [5]:
dataframe.iloc[2 : 5, 1 : 4 : 2] #it will display only required rows and column.

  Location  Score
2       NY    8.0
3       NY    2.0
4      NaN    NaN

In [6]:
dataframe['Age'] #it will display ony one column = Age with datatype.

0     NaN
1    32.0
2     NaN
3    33.0
4     NaN
5    53.0
6    34.0
7    21.0
Name: Age, dtype: float64

In [7]:
middle = dataframe['Age'].mean()   #it will display the middle value of age column.
minimum = dataframe['Age'].min()    #it will display the min value of age column. 
maximum = dataframe['Age'].max()    #it will display the max value of age column.
print('Middle Value = ', middle)
print('Minimum Value = ', minimum)
print('Maximum Value = ', maximum)

Middle Value =  34.6
Minimum Value =  21.0
Maximum Value =  53.0

In [8]:
dataframe['BloodGroup'].mode() #display the mode of paricular column.

0    A-ve
1    B+ve
Name: BloodGroup, dtype: object

In [9]:
dataframe.describe() #its give statical data.

             Age     Score  Eligible
count   5.000000  7.000000  7.000000
mean   34.600000  5.428571  0.428571
std    11.545562  3.309438  0.534522
min    21.000000  1.000000  0.000000
25%    32.000000  3.000000  0.000000
50%    33.000000  5.000000  0.000000
75%    34.000000  8.500000  1.000000
max    53.000000  9.000000  1.000000

In [10]:
dataframe.dtypes     #It will print datatype of all the columns .

Name           object
Location       object
Age           float64
Score         float64
BloodGroup     object
Eligible      float64
dtype: object

In [11]:
dataframe.drop('Eligible', axis = 1) #droping paricular column = Eligible.

    Name Location   Age  Score BloodGroup
0   Jhon       CA   NaN    9.0       B+ve
1   Mike       LA  32.0    9.0       B+ve
2   Dane       NY   NaN    8.0       A-ve
3  Peter       NY  33.0    2.0       O+ve
4  Macey      NaN   NaN    NaN       O-ve
5  Chimp       CA  53.0    4.0       A-ve
6  Jacob    TEXAS  34.0    5.0       A+ve
7   Dany       DC  21.0    1.0      AB-ve